[ {
    "id": 1,
    "quote": "If someone ever asks me in the future to list down my proudest non-academic achievements during B.Tech, serving as the Chairman of KIIT E-Cell would definitely sit right at the top. From leading a team full of potential future CEOs, change-makers, and extremely creative people, to running from TnP office to VC sir’s cabin like it was my second home",
    "author": "Sarvagya Singh",
    "position": "Chairman"
  },
  {
    "id": 2,
    "quote": "The Entrepreneurship Cell has unquestionably been one of the best parts of my college journey. I joined as a quiet, introverted person, but this amazing team quickly became like a family. From going out for sponsorships and calling up speakers to managing events with 1000+ people, it’s been a wild and rewarding ride. ",
    "author": "Aman Kumar",
    "position": "Managing Director"
  },
  {
    "id": 3,
    "quote": "My college life was inseparable from KIIT Entrepreneurship Cell. E-Cell shaped how I think and how I see the world. It taught me leadership, helped me find my voice, and most importantly helped me grow into a better person. To anyone joining E-Cell now, give it your all. It is not just an organization, it is an experience that stays with you long after college ends.",
    "author": "Shashank Shekhar",
    "position": "Ex-Chairman"
  },
  {
    "id": 4,
    "quote": " E-Cell gave me the confidence to face any challenge that comes my way. Today, when I see my juniors walking the same path, I feel proud and nostalgic about the incredible moments I had with KIIT E-Cell.",
    "author": "Tushar Bhattarai",
    "position": "Executive Director - Outreach"
  },
  {
    "id": 5,
    "quote": "At E-Cell, The experience honed my skills in digital outreach, brand positioning, and audience engagement. It gave me hands-on exposure to promoting entrepreneurial ideas and collaborating cross-functionally to drive event success",
    "author": "Tushit Mittal",
    "position": "Senior Executive"
  },
  {
    "id": 6,
    "quote": "E-Cell has been the heart of my college life—nearly all my cherished memories are tied to it. E-Cell helped me rediscover a part of myself that had been long lost. Everything I have today—my personality, my placement, and my closest friends, I owe to the cell.",
    "author": "Aditya Srivastava",
    "position": "Chief Financial Officer"
  },
  {
    "id": 7,
    "quote": "Being part of E-Cell has been one of the most meaningful experiences of my college journey. E-Cell taught me how to lead with empathy, stay resilient through uncertainty, and act on ideas with purpose. It’s a journey I’ll always be grateful for — one that gave me confidence, clarity, and a sense of belonging.",
    "author": "Pragya Pranjal",
    "position": "Director, Public and Corporate Relations"
  },
  {
    "id": 8,
    "quote": "My experience with E-Cell has been truly transformative. Being part of the team pushed me out of my comfort zone and gave me the confidence to communicate and pitch ideas to anyone. Overall, E-Cell helped me grow both personally and professionally, and I’m grateful for the skills and memories I’ve gained along the way.",
    "author": "Rayan Alam",
    "position": "Executive Director - Advisory"
  },
  {
    "id": 9,
    "quote": "My experience since the time of joining had been very good every senior in-fact every member of the cell is just so cool and friendly.E cell made me work oriented but with a fun material it up lifted all my skills like communications , leadership, teamwork. ",
    "author": "Vaibhav Aryan",
    "position": "Associate"
  }
 
]
